backend/load-test.yml
config:
  target: "http://localhost:3000/api/v1"
  phases:
    - duration: 60
      arrivalRate: 35

scenarios:
  - name: "Login y acceso protegido"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "customer1@example.com"
            password: "customer123"
          capture:
            - json: "$.token"
              as: accessToken
      - think: 2
      - get:
          url: "/user/profile"
          headers:
            Authorization: "Bearer {{ accessToken }}"